Update 01-architecture.md
